#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Перем ПараметрыЗапуска;
	Перем Файл;
	
	Если ( ПустаяСтрока(ПараметрЗапуска) ) Тогда
		
		ЗавершитьРаботуСистемы(Ложь);
		
	КонецЕсли;

	Если ( СоздатьПервогоАдминистратораПриНеобходимости("Администратор", ПараметрЗапуска) ) Тогда
		
		ЗавершитьРаботуСистемы(Ложь);
		
	КонецЕсли;
	
	ПараметрыЗапуска = ПараметрыЗапуска( ПараметрЗапуска );
	
	Файл = ПараметрыЗапуска.Получить( "FROM-JSON" );
	
	Если ( Файл <> Неопределено ) Тогда
		
		СоздатьПользователейJson( Файл );
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция СоздатьПервогоАдминистратораПриНеобходимости( Имя, ПараметрЗапуска )
	 
	Перем СоздаватьАдминистратора;
	Перем Администратор;
	
	Если ( ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() > 0 ) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	СоздаватьАдминистратора = ( СтрНайти(ВРег(ПараметрЗапуска), "CREATEADMIN") > 0 
									ИЛИ СтрНайти(ВРег(ПараметрЗапуска), "СОЗДАТЬАДМИНИСТРАТОРА") > 0
									И Метаданные.Роли.Найти("ПолныеПрава") <> Неопределено );
	
	Если ( НЕ СоздаватьАдминистратора ) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Администратор = ПользователиИнформационнойБазы.СоздатьПользователя();
	Администратор.Имя = Имя;
	Администратор.АутентификацияСтандартная = Истина;
	Администратор.ПоказыватьВСпискеВыбора = Истина;
	Администратор.ПолноеИмя = Имя;
	Администратор.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
	Администратор.Язык = Метаданные.Языки.Русский;
	Администратор.Записать();
	
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Процедура СоздатьПользователейJson( Файл )
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыЗапуска( Знач ПараметрЗапуска )

	Перем ПараметрыЗапуска;
	Перем ЭлементыПараметра;
	Перем Результат;
	
	Результат = Новый Соответствие();
	
	ПараметрыЗапуска = СтрРазделить( ПараметрЗапуска, ";", Ложь );
	
	Для Каждого Параметр Из ПараметрыЗапуска Цикл
		
		ЭлементыПараметра = СтрРазделить( Параметр, "=", Ложь );
		
		Если ( ЗначениеЗаполнено(ЭлементыПараметра) ) Тогда
			
			Если ( ЭлементыПараметра.Количество() = 1 ) Тогда
				
				Результат.Вставить(ВРег(ЭлементыПараметра[0]));
				Продолжить;
				
			КонецЕсли;
			
			Если ( ЭлементыПараметра.Количество() = 2 ) Тогда
				
				Результат.Вставить(ВРег(ЭлементыПараметра[0]), ЭлементыПараметра[1]);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти