#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Перем ПараметрыЗапуска;
	
	Если ( ПустаяСтрока(ПараметрЗапуска) ) Тогда
		
		ЗавершитьРаботуСистемы(Ложь);
		
	КонецЕсли;

	Если ( СоздатьПервогоАдминистратораПриНеобходимости("Администратор", ПараметрЗапуска) ) Тогда
		
		ЗавершитьРаботуСистемы(Ложь);
		
	КонецЕсли;
	
	ПараметрыЗапуска = ПараметрыЗапуска( ПараметрЗапуска );
	
	СоздатьПользователейИзФайлаJson( ПараметрыЗапуска );

	ЗавершитьРаботуСистемы(Ложь);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Если НЕ ВебКлиент Тогда
	
&НаКлиенте
Функция ПрочитатьДанныеИзФайлаJson( Знач Файл )
	
	Перем Результат;
	Перем ЧтениеJson;
	
	Попытка
	
		ЧтениеJson = Новый ЧтениеJSON();
		ЧтениеJson.ОткрытьФайл( Файл.ПолноеИмя );
		Результат = ПрочитатьJSON( ЧтениеJson, Ложь );
		ЧтениеJson.Закрыть();
		
	Исключение
		
		ЧтениеJson = Неопределено;
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли

&НаКлиенте
Функция ПараметрыЗапуска( Знач ПараметрЗапуска )

	Перем ПараметрыЗапуска;
	Перем ЭлементыПараметра;
	Перем Результат;
	
	СОДЕРЖИТ_КЛЮЧ_И_ЗНАЧЕНИЕ = 2;
	
	Результат = Новый Соответствие();
	
	ПараметрыЗапуска = СтрРазделить( ПараметрЗапуска, ";", Ложь );
	
	Для Каждого Параметр Из ПараметрыЗапуска Цикл
		
		ЭлементыПараметра = СтрРазделить( Параметр, "=", Ложь );
		
		Если ( ЗначениеЗаполнено(ЭлементыПараметра) ) Тогда
			
			Если ( ЭлементыПараметра.Количество() = 1 ) Тогда
				
				Результат.Вставить(ВРег(ЭлементыПараметра[0]));
				Продолжить;
				
			КонецЕсли;
			
			Если ( ЭлементыПараметра.Количество() = СОДЕРЖИТ_КЛЮЧ_И_ЗНАЧЕНИЕ ) Тогда
				
				Результат.Вставить(ВРег(ЭлементыПараметра[0]), ЭлементыПараметра[1]);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция СоздатьПервогоАдминистратораПриНеобходимости( Имя, ПараметрЗапуска )

	Перем Роли;	 
	Перем СоздаватьАдминистратора;
	Перем Успех;
	
	ПОЛНЫЕ_ПРАВА = "ПолныеПрава";
	
	Успех = Ложь;
	
	Если ( ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() > 0 ) Тогда
		
		Возврат Успех;
		
	КонецЕсли;
	
	СоздаватьАдминистратора = ( СтрНайти(ВРег(ПараметрЗапуска), "CREATEADMIN") > 0 
									ИЛИ СтрНайти(ВРег(ПараметрЗапуска), "СОЗДАТЬАДМИНИСТРАТОРА") > 0
									И Метаданные.Роли.Найти(ПОЛНЫЕ_ПРАВА) <> Неопределено );
	
	Если ( НЕ СоздаватьАдминистратора ) Тогда
		
		Возврат Успех;
		
	КонецЕсли;
	
	Роли = Новый Массив();
	Роли.Добавить( ПОЛНЫЕ_ПРАВА );
	
	СоздатьПользователя( Имя, Роли, Успех );
	
	Возврат Успех;
	
КонецФункции

&НаКлиенте
Процедура СоздатьПользователейИзФайлаJson( Знач ПараметрыЗапуска )
	
	Перем ПутьКФайлу;
	Перем Файл;
	Перем ДанныеИзФайла;
	Перем Пользователи;
	
	ПутьКФайлу = ПараметрыЗапуска.Получить( "USERS-FROM-JSON" );
	
	Если ( ПутьКФайлу = Неопределено ) Тогда
		
		Возврат;
	
	КонецЕсли;
		
	Файл = Новый Файл( ПутьКФайлу );
	
	Если ( НЕ Файл.Существует() ) Тогда
		
		Возврат;
		
	КонецЕсли;
	
#Если НЕ ВебКлиент Тогда
	
	ДанныеИзФайла = ПрочитатьДанныеИзФайлаJson(Файл);
	
#Иначе
	
	ДанныеИзФайла = Неопределено;
	
#КонецЕсли

	ДанныеИзФайла.Свойство( "users", Пользователи );
	
	Если ( Пользователи <> Неопределено ) Тогда
		
		СоздатьПользователей( Пользователи );
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьПользователей( Знач Пользователи )
	
	Перем Успех;
	
	Успех = Ложь;

	Для Каждого Пользователь Из Пользователи Цикл
		
		СоздатьПользователя( Пользователь.name, Пользователь.roles, Успех );
		
	КонецЦикла;	

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьПользователя( Знач Имя, Знач Роли, Отказ = Ложь )
	
	Перем Пользователь;
	Перем ТекстСообщения;
	
	ЯЗЫК_РУССКИЙ = Метаданные.Языки.Русский;
	
	Попытка
		
		Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		
		Пользователь.Имя = Имя;
		Пользователь.АутентификацияСтандартная = Истина;
		Пользователь.ПоказыватьВСпискеВыбора = Истина;
		Пользователь.ПолноеИмя = Имя;
		Пользователь.Язык = ЯЗЫК_РУССКИЙ;
		
		Для Каждого Роль Из Роли Цикл
			Пользователь.Роли.Добавить(Метаданные.Роли[Роль]);			
		КонецЦикла;

		Пользователь.Записать();	
		
	Исключение
		
		Отказ = Истина;
		
		ТекстСообщения =  НСтр("ru = 'Ошибка создания пользователя %1: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Имя, ОписаниеОшибки());
		ЗаписьЖурналаРегистрации( "Инициализация.Пользователи.Создание",
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ТекстСообщения);

	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти